mybord/app/controllers/auths_controller.rb

  def create
    user = User.find_by(username: auth_params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "aaaaaa"], ["LIMIT", 1]]