mybord/app/controllers/password_resets_controller.rb

  def edit
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def update
    user = User.find_by(id: current_user.id)

    if user&.authenticate(reset_params[:password]) && reset_params[:reset] == reset_params[:reset_confirmation]
      user.update(password: reset_params[:reset])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$/PFXn//xKPwqWmoJbNJHC.MPWUtFDcrn4V2nDare7MvFqhKRr/M8."], ["updated_at", "2019-08-09 07:02:58.774264"], ["id", 13]]