mybord/app/controllers/posts_controller.rb

def index
  @posts  = Post.page(params[:page]).per(PER).order(created_at: :desc)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

def create
  @post = current_user.posts.new(post_params)
  if @post.save
---
INSERT INTO "posts" ("name", "mail", "message", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "a"], ["mail", "a@a.com"], ["message", "a"], ["created_at", "2019-07-21 17:24:03.510144"], ["updated_at", "2019-07-21 17:24:03.510144"], ["user_id", 1]]

def destroy
  post = current_user.posts.find(params[:id])
  post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 125]]

def show
  @post = Post.find_by(id: params[:id])
  @user = User.find_by(id: @post.user_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 140], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]