mybord/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "mail", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduce" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduce", "xxxxx"], ["updated_at", "2019-07-31 07:24:13.585672"], ["id", 13]]

  def password_edit
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]